Revit 2027 API
RenderingSettings.PrinterResolution Property
 The resolution level when using printer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PrinterResolution PrinterResolution { get; set; }
Public Property PrinterResolution As PrinterResolution
	Get
	Set
public:
property PrinterResolution PrinterResolution {
	PrinterResolution get ();
	void set (PrinterResolution value);
}
member PrinterResolution : PrinterResolution with get, set
Property Value
PrinterResolution
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The resolution target is not printer.
Remarks
 The suitable resolution value is decided by default. You may obtain it from the ResolutionValue property.
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace